app/Controllers/Pengguna.php

SELECT *
FROM `t_akun_siswa`
ORDER BY `IDAkun` ASC
---
    public function akun_siswa()
    {
        $data = array(
            'akun_siswa' => $this->MPengguna->orderBy('IDAkun', 'ASC')->findAll(),
            'session' => \Config\Services::session()
        );