app/Controllers/Siswa.php

    public function data_siswa()
    {
        $data = array(
            'session' => \Config\Services::session(),
            'siswa' => $this->MSiswa->join('t_kelas', 't_kelas.IDKelas = t_siswa.IDKelas', 'left')->join('t_jurusan', 't_jurusan.IDJurusan = t_siswa.IDJurusan', 'left')->orderBy('NISN', 'ASC')->findAll()
        );
---
SELECT *
FROM `t_siswa`
LEFT JOIN `t_kelas` ON `t_kelas`.`IDKelas` = `t_siswa`.`IDKelas`
LEFT JOIN `t_jurusan` ON `t_jurusan`.`IDJurusan` = `t_siswa`.`IDJurusan`
ORDER BY `NISN` ASC